;;; ~/.doom.d/packages.el -*- no-byte-compile: t; -*-
(package! lsp-mode)
(package! company-lsp)
(package! lsp-ui)
(package! ccls)
(package! cquery)
;(package! org-noter)
;(package! esh-autosuggest)
;(package! fish-completion)
;(package! docker-tramp)
;(package! org-super-agenda)
;(package! org-brain)

(package! goto-last-change)
(package! resize-window)
(package! www-synonyms)
(package! ag)

;(package! ob-ipython :recipe (:fetcher github :repo "fuxialexander/ob-ipython" :files ("*.el" "*.py")))
